results/deno/acorn.txt
Bundle: n/a
Startup: 181.3 ms
Memory before: 104.6 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     12961.19    4184.30   25735.77
  Latency       38.51ms   357.69ms     10.03s
  HTTP codes:
    1xx - 0, 2xx - 129449, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.02MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     13522.62    5835.82   24452.15
  Latency       36.90ms   226.82ms      9.96s
  HTTP codes:
    1xx - 0, 2xx - 135147, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.68MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     13704.29    7882.00   46042.81
  Latency       36.46ms    54.02ms      2.06s
  HTTP codes:
    1xx - 0, 2xx - 136665, 3xx - 0, 4xx - 0, 5xx - 0
    others - 80
  Errors:
       timeout - 80
  Throughput:     4.36MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       267.59     144.43     522.10
  Latency       37.33ms     3.73ms    86.27ms
  HTTP codes:
    1xx - 0, 2xx - 2684, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.53GB/s

Memory after: 247.7 MB