results/deno/deno.txt
Bundle: n/a
Startup: 52.9 ms
Memory before: 57.0 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    225680.79   41282.89  272848.92
  Latency        2.22ms     0.88ms   106.04ms
  HTTP codes:
    1xx - 0, 2xx - 2247862, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    38.37MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    198146.04   33310.16  228223.75
  Latency        2.53ms   666.67us    90.23ms
  HTTP codes:
    1xx - 0, 2xx - 1968435, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    41.29MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    226707.21   32416.32  270023.26
  Latency        2.21ms   487.42us    74.45ms
  HTTP codes:
    1xx - 0, 2xx - 2257314, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    57.90MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       418.22      71.31     574.86
  Latency       23.89ms     2.21ms    62.99ms
  HTTP codes:
    1xx - 0, 2xx - 4188, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     5.51GB/s

Memory after: 89.7 MB